Only record the stuff I want to know.

# Set
## 关系
A 是一个集合, A× A 的一个子集R, 称为是集合A 上的一个二元关系, 简称关系
## 定义1 .1 .2 设集合A, R 是A 上的关系:
1. 对每个a∈ A, 如果有a R a , 称R 是自反的;
2. 对于a, b∈ A, 如果有a R b , 又有b R a , 称R 是对称的;
3. 对于 a, b∈ A,如果有 a R b 和 b R a ,则必有 a = b,称 R 是 反对称的;
4. 对于 a , b , c∈A,如果有 a Rb 和 b Rc,则有 a Rc,称 R 是传递的;
5. 对每个 a∈ A,如果 a/R a,称 R 是反自反的。
## 等价关系
设 R 是非空集合A 上的一个关系, 如果R 有自反性、对称性和传递性, 则称R 是一个等价关系
## 偏序关系
设 R 是集合A 上的一个关系, 如果R 有自反性、反对称性和传递性, 则称R 是偏序关系(或部分序关系)。
## 关系的闭包
设 R 是集合A 上的关系, 如果另有关系R′满足:
(1) R′是传递的( 自反的, 对称的) ;
(2) R′Ê R;
(3) 对任何传递的(自反的、对称的) 关系R″, 当有R″Ê R, 就有R″Ê R′, 则称关系R′是R 的传递(自反、对称)闭包。
R 的自反闭包表示为r( R) , R 的对称闭包表示为s( R) , R 的传递闭包表示为t ( R)。
